<template>
  <div class="about-wrapper">
    <div class="about">
      <h1 class="title">О нас</h1>
      <div class="text">
        <h2>Добро пожаловать в кофейню "Кейк"!</h2>

        Мы — уютная кофейня в самом сердце города, где царит атмосфера уюта и гостеприимства. Наша
        цель — сделать каждый ваш визит особенным, наполненным ароматом свежесваренного кофе и
        вкусом изысканных десертов.

        <h2>История и миссия</h2>
        Кофейня "Кейк" была основана в 2015 году с одной простой идеей: создать место, где каждый
        может насладиться качественным кофе и вкусными домашними десертами в приятной атмосфере.
        Наша миссия — предоставлять нашим гостям лучшее кофейное и кулинарное искусство, сочетая
        традиции и современные тенденции.

        <h2>Наше меню</h2>
        Мы гордимся нашим разнообразным меню, в котором каждый найдет что-то по вкусу. Наша кофейная
        карта включает в себя классические эспрессо, капучино, латте, а также авторские напитки и
        сезонные предложения. Все наши десерты — это результат кропотливой работы наших кондитеров,
        которые используют только свежие и натуральные ингредиенты.

        <h2>Команда</h2>
        В "Кейк" работает команда профессионалов, для которых кофе — это не просто напиток, а
        настоящее искусство. Наши бариста с удовольствием расскажут вам о тонкостях приготовления
        каждого напитка и подберут именно тот, который придется вам по душе. Кондитеры с любовью
        создают шедевры, которые радуют глаз и пленяют вкус.

        <h2>Атмосфера</h2>
        Мы создали пространство, где можно насладиться моментом: будь то утренний кофе с друзьями,
        деловая встреча или романтический вечер. Уютный интерьер, дружелюбный персонал и приятная
        музыка — все это делает "Кейк" идеальным местом для отдыха и встреч.

        <h2>Социальная ответственность</h2>
        Мы заботимся о нашем сообществе и окружающей среде. В "Кейк" мы стараемся использовать
        экологически чистые продукты и минимизировать отходы. Кроме того, мы поддерживаем местных
        поставщиков и участвуем в благотворительных инициативах.

        <h2>Приглашаем вас в "Кейк"</h2>
        Приходите в "Кейк" и откройте для себя мир вкусов, ароматов и приятных эмоций. Мы всегда
        рады новым гостям и сделаем все возможное, чтобы ваш визит стал незабываемым. Спасибо, что
        выбираете нас!
      </div>
    </div>
  </div>
</template>

<script>
export default {}
</script>

<style lang="scss" scoped>
.about-wrapper {
  position: absolute;
  left: 0;
  right: 0;
  top: 0;
  bottom: 0;
  display: flex;
  justify-content: center;
  padding: 150px 0;
}

.about {
  width: 70rem;
  display: flex;
  flex-direction: column;
  gap: 48px;

  .text {
    display: flex;
    flex-direction: column;
    gap: 16px;
    line-height: 1.5;
    font-size: 22px;
  }
}
</style>
